import type { IMovie } from '../../types'

export const movies: IMovie[] = [
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/4b27e219-a8a5-4d85-9874-57d6016e0837/600x900',
    name: 'Зеленая книга',
    year: '2018',
    rating: '8.5',
    duration: '2ч 10м',
    genres: ['биография', 'комедия', 'драма'],
    description:
      '1960-е годы. После закрытия нью-йоркского ночного клуба на ремонт вышибала Тони по прозвищу Болтун ищет подработку на пару месяцев. Как раз в это время Дон Ширли — утонченный светский лев, богатый и талантливый чернокожий музыкант, исполняющий классическую музыку — собирается в турне по южным штатам, где ещё сильны расистские убеждения и царит сегрегация. Он нанимает Тони в качестве водителя, телохранителя и человека, способного решать текущие проблемы. У этих двоих так мало общего, и эта поездка навсегда изменит жизнь обоих.',
    id: '1108577',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/ae3b699c-3db7-4196-a869-39b610bfe706/600x900',
    name: 'Унесённые призраками',
    year: '2001',
    rating: '8.5',
    duration: '2ч 4м',
    genres: ['аниме', 'мультфильм', 'фэнтези', 'приключения', 'семейный'],
    description:
      'Тихиро с мамой и папой переезжает в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе, где их ждет великолепный пир. Родители с жадностью набрасываются на еду и к ужасу девочки превращаются в свиней, став пленниками злой колдуньи Юбабы. Теперь, оказавшись одна среди волшебных существ и загадочных видений, Тихиро должна придумать, как избавить своих родителей от чар коварной старухи.',
    id: '370',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/a2d5bcae-a1a9-442f-8195-f5373a5ba77f/600x900',
    name: 'Властелин колец: Братство кольца',
    year: '2001',
    rating: '8.6',
    duration: '2ч 58м',
    genres: ['фэнтези', 'приключения', 'драма', 'боевик'],
    description:
      'Сказания о Средиземье — это хроника Великой войны за Кольцо, длившейся не одну тысячу лет. Тот, кто владел Кольцом, получал неограниченную власть, но был обязан служить злу.',
    id: '328',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/637271d5-61b4-4e46-ac83-6d07494c7645/600x900',
    name: 'Джентльмены',
    year: '2019',
    rating: '8.6',
    duration: '1ч 53м',
    genres: ['криминал', 'комедия', 'боевик'],
    description:
      'Один ушлый американец ещё со студенческих лет приторговывал наркотиками, а теперь придумал схему нелегального обогащения с использованием поместий обедневшей английской аристократии и очень неплохо на этом разбогател. Другой пронырливый журналист приходит к Рэю, правой руке американца, и предлагает тому купить киносценарий, в котором подробно описаны преступления его босса при участии других представителей лондонского криминального мира — партнёра-еврея, китайской диаспоры, чернокожих спортсменов и даже русского олигарха.',
    id: '1143242',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/6201401/8662d92a-5881-4600-a7ae-549e6fd53b03/600x900',
    name: 'Леон',
    year: '1994',
    rating: '8.7',
    duration: '2ч 13м',
    genres: ['боевик', 'триллер', 'драма', 'криминал'],
    description:
      'Профессиональный убийца Леон неожиданно для себя самого решает помочь 12-летней соседке Матильде, семью которой убили коррумпированные полицейские.',
    id: '389',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/1599028/7c3460dc-344d-433f-8220-f18d86c8397d/600x900',
    name: 'Гладиатор',
    year: '2000',
    rating: '8.6',
    duration: '2ч 35м',
    genres: ['боевик', 'драма', 'история'],
    description:
      'Римская империя. Бесстрашного и благородного генерала Максимуса боготворят солдаты, а старый император Марк Аврелий безгранично доверяет ему и относится как к сыну. Однако опытный воин, готовый сразиться с любым противником в честном бою, оказывается бессильным перед коварными придворными интригами. Коммод, сын Марка Аврелия, убивает отца, который планировал сделать преемником не его, а Максимуса, и захватывает власть. Решив избавиться от опасного соперника, который к тому же отказывается присягнуть ему на верность, Коммод отдаёт приказ убить Максимуса и всю его семью. Чудом выжив, но не сумев спасти близких, Максимус попадает в плен к работорговцу, который продаёт его организатору гладиаторских боёв Проксимо. Так легендарный полководец становится гладиатором. Но вскоре ему представится шанс встретиться со своим смертельным врагом лицом к лицу.',
    id: '474',
  },
  {
    imgURL:
      'https://avatars.mds.yandex.net/get-kinopoisk-image/4483445/df6c9527-c2cb-4a17-b4bd-1ed05d2e733d/600x900',
    name: 'Достучаться до небес',
    year: '1997',
    rating: '8.6',
    duration: '1ч 27м',
    genres: ['криминал', 'комедия', 'драма'],
    description:
      'Волею судеб две абсолютные противоположности, тихоня Руди и разгильдяй Мартин, оказываются в одной больничной палате. Узнав неутешительные прогнозы, друзья решают использовать последние дни на полную катушку — угнать машину с деньгами, напиться текилы, и, конечно, увидеть море.',
    id: '32898',
  },
]
